export default [
  {
    id: 0,
    name: 'Можно выполнять сразу после прверки',
  },
  {
    id: 1,
    name: 'Через 1 час поле подачи предыдущего отчета',
  },
  {
    id: 2,
    name: 'Через 3 часа после подачи предыдущего отчета',
  },
  {
    id: 3,
    name: 'Через 6 часов после подачи предыдущего отчета',
  },
  {
    id: 4,
    name: 'Через 12 часов после подачи предыдущего отчета',
  },
  {
    id: 5,
    name: 'Через 1 сутки после подачи предыдущего отчета',
  },
  {
    id: 6,
    name: 'Через 2 сутки после подачи предыдущего отчета',
  },
  {
    id: 7,
    name: 'Через 3 суток после подачи предыдущего отчета',
  },
];
