/* eslint-disable-next-line max-len */
import React from 'react';
import Container from 'react-bootstrap/Container';
import Row from 'react-bootstrap/Row';
import Col from 'react-bootstrap/Col';

export default () => (
  <Container className="vh-80">
    <Row className="pt-5">
      <Col>
        <h1>Оферта</h1>
        <p>
          Настоящий Договор-Оферта с Пользователем (далее “Договор-Оферта“ или ”Договор”)
          заключается между администрацией сайта task.bz и лицом, принявшим условия настоящего
          публичного Договора-Оферты путём успешного прохождения регистрации на сайте task.bz и
          начала использования сервиса (далее “Пользователь“). Пожалуйста, внимательно изучите текст
          настоящего Договора-Оферты. Принятие настоящего Договора-Оферты путём успешного
          прохождения регистрации на сайте task.bz и начала использования сервиса означает
          подтверждение свободного волеизъявления Пользователя, направленного на полное и
          безоговорочное принятие условий настоящего Договора-Оферты и всех иных документов, ссылки
          на которые приведены в настоящем Договоре-Оферте, и присоединение к настоящему
          Договору-Оферте на приведённых ниже условиях. Для целей настоящего Договора-Оферты
          Пользователь и Оператор далее совместно именуются “Стороны“, а по отдельности “Сторона“.
          <br />
          <br />
          Принимая условия настоящего Договора-Оферты Пользователь заявляет и гарантирует, что
          Пользователь достиг(ла) как минимум 18 (Восемнадцати) - летнего возраста и является
          совершеннолетним (совершеннолетней) по законодательству юрисдикции, гражданином
          (гражданкой) которого является Пользователь, либо является должным образом
          зарегистрированным индивидуальным предпринимателем, либо является должным образом
          уполномоченным представителем либо работником соответствующего юридического лица, в
          зависимости от того, что применимо.
        </p>
        <h2>Определения</h2>
        <p>
          Для целей настоящего Договора-Оферты приведённые ниже определения будут иметь следующие
          значения:
          <br />
          <b>&quot;Сервис TASK &quot;</b>
          означает принадлежащий Оператору интерактивный программный комплекс и сервис,
          включая веб-сайт, предназначенные для предоставления Пользователю Услуг, доступный в сети
          Интернет по уникальному адресу https://task.bz, используемый Оператором для предоставления
          и оказания Пользователю Услуг в соответствии с настоящими Условиями.
          <br />
          <b>&quot;Услуги&quot;</b>
          совместно означают платные услуги, которые Оператор
          предоставляет и делает
          доступными для Пользователя посредством либо с использованием Сервиса TASK. Под Услугами
          понимаются, в частности, предоставление Пользователю возможности использования
          определённой
          функциональности Сервиса TASK по модели Software-as-a-Service (&quot;Программа для ЭВМ как
          услуга&quot;). Услуги включают в себя любые дополнительные либо опциональные услуги,
          предлагаемые
          Оператором посредством Сервиса TASK в связи с любыми из Услуг. Полное описание всех Услуг,
          доступных Пользователю, доступно в Личном Кабинете Пользователя в Сервисе TASK.
          <br />
          <b>&quot;Пользователь&quot;</b>
          означает физическое лицо, индивидуального предпринимателя либо юридическое
          лицо, не являющееся резидентом Российской Федерации, и зарегистрированное в Сервисе TASK,
          в
          качестве Пользователя и принявшее настоящий Договор-Оферту и условия Связанных Документов,
          в
          том числе, Условия Предоставления Услуг TASK.
          <br />
          <b>&quot;Личный Кабинет&quot;</b>
          означает персонализированный раздел Сервиса TASK, закрытый для публичного
          доступа. Доступ к Личному Кабинету осуществляется посредством ввода на странице входа в
          Сервис TASK аутентификационных данных: email (почты пользователя) и пароля (кода доступа).
          <br />
          <b>&quot;Цена Услуг&quot;</b>
          означает цену услуг, выплачиваемую Пользователем Оператору за Услуги.
          <br />
          <b>&quot;Отчётный Период&quot;</b>
          означает 1 (Один) календарный месяц.
          <br />
          <b>&quot;Вебсайт&quot;</b>
          означает вебсайт в сети Интернет, которым владеет, и/или управляет, и/или который
          администрирует какой-либо Пользователь Сервиса TASK (включая Пользователя, принимающего
          настоящий Договор-Оферту с Пользователем и Условия Предоставления Услуг), включённый в
          перечень Вебсайтов Сервиса TASK.
          Все остальные термины, пишущиеся с заглавной буквы и используемые в настоящем
          Договоре-Оферте имеют значения, присвоенные им в Условиях Предоставления Услуг.
        </p>
        <h2>1. Предмет договора-оферты</h2>
        1.1. Принимая условия настоящего Договора-Оферты и создавая Личный Кабинет Пользователя в
        Сервисе TASK Пользователь соглашается выплачивать Оператору Цену Услуг за Услуги, а Оператор
        предоставляет Пользователю возможность осуществления доступа к и использования Сервиса TASK
        (в том числе, получения Услуг) на условиях настоящего Договора-Оферты и Связанных Документов
        за Цену Услуг.
        <br />
        1.2. Сервис TASK и Услуги предоставляются Пользователю по модели &quot;Программа для ЭВМ как
        Услуга&quot; (&quot;Software-as-a-Service&quot;). Пользователю не предоставляются какие-либо
        имущественные
        интеллектуальные права в отношении Сервиса TASK, по лицензии либо иным образом.
        <br />
        1.3. Полный перечень Услуг, доступных для выбора Пользователем, отображается в Личном
        Кабинете Пользователя в Сервисе TASK.
        <br />
        1.4. Использование Сервиса TASK и определённые требования и правила в отношении Услуг
        содержатся в Связанных Документах, как они определены в настоящем Договоре-Оферте, включая,
        но не ограничиваясь этим, Условиях Предоставления Услуг. Все положения таких Связанных
        Документов применяются к настоящему Договору-Оферте как если бы они были прямо в него
        включены, и включены в него посредством ссылки.
        <br />
        <h2>2. Права и обязанности сторон</h2>
        2.1. Пользователь вправе:
        <br />
        2.1.1. отказаться от получения Услуг и прекратить использование Сервиса TASK;
        <br />
        2.1.2. выводить суммы Вознаграждения Пользователя на условиях настоящего Договора-Оферты;
        <br />
        2.1.3. использовать функциональность Сервиса TASK в соответствии с её целевым
        предназначением.
        <br />
        2.2. Пользователь обязан:
        <br />
        2.2.1. зарегистрировать Личный Кабинет в качестве Пользователя в Сервисе TASK;
        <br />
        2.2.2. надлежащим образом охранять имя пользователя и пароль Пользователя, используемые для
        осуществления доступа к и использования Сервиса TASK от недобросовестного использования
        третьими лицами, и незамедлительно уведомлять Оператора о любых случаях недобросовестного
        использования посредством Обратной Связи;
        <br />
        2.2.3. своевременно пополнять баланс в Личном Кабинете суммами, достаточными для оплаты Цены
        Услуг.
        <br />
        2.3. Оператор вправе:
        <br />
        2.3.1. отказать в предоставлении Услуг в случае их несоответствия требованиям, установленным
        Связанными Документами;
        <br />
        2.3.2. отказать в предоставлении Услуг и заблокировать Личный Кабинет Пользователя без
        выплаты баланса, если выяснится, что Пользователь нарушил любое из условий настоящего
        Договора-Оферты либо Связанных Документов.
        <br />
        2.4. Оператор обязуется:
        <br />
        2.4.1. в случаях, когда это применимо, своевременно выплачивать Пользователю Вознаграждение
        Пользователя в порядке и образом, установленными в настоящем Договоре-Оферте.
        <br />
        <h2>3. Платежи, расчёты, отчётность</h2>
        3.1. За Услуги по настоящему Договору-Оферте Пользователь выплачивает Оператору Цену Услуг.
        Цена Услуг за Услуги выплачивается Пользователем авансом в размере 100% (Ста процентов) Цены
        Услуг за Услуги, которые Пользователь планирует получить в соответствующем Отчётном Периоде,
        и считается полностью оплаченным в момент получения соответствующих сумм предоплаты
        Оператором на расчётный счёт Оператора.
        <br />
        3.2. Все платежи Цены Услуг по настоящему Договору-Оферте должны быть совершены
        Пользователем в доступных для выбора в Личном Кабинете валютах способом, выбранным
        Пользователем в Личном Кабинете.
        <br />
        3.3. Оператор оставляет за собой право в одностороннем порядке изменять размер Цены Услуг за
        определённые Услуги.
        <br />
        3.4. Безналичная оплата сумм Цены Услуг доступна только Пользователям – индивидуальным
        предпринимателям и юридическим лицам. Если Пользователь изначально зарегистрировал Личный
        Кабинет в Сервисе TASK как физическое лицо, но желает оплатить Цену Услуг по безналичному
        расчёту, Пользователю может потребоваться заключить договор, позволяющий осуществлять
        безналичную оплату Цены Услуг.
        <br />
        3.5. Все совершённые Пользователем платежи Цены Услуг за Услуги не подлежат отмене, и все
        суммы Цены Услуг, уплаченные за Услуги, не подлежат возмещению, но засчитываются в счёт
        Услуг, которые могут быть предоставлены Оператором Пользователю в будущем.
        <br />
        3.6. За определённые действия (такие, как выполнение Пользователем работ и/или оказание
        Пользователем услуг в рамках различных Предложений услуг, размещаемых Пользователем в
        Сервисе TASK и заказываемых другими Пользователями Сервиса TASK) Пользователь может получать
        вознаграждение (&quot;Вознаграждение Пользователя&quot;). Вознаграждение Пользователя
        (включая
        вознаграждение за выполнение работ и услуг в рамках различных Предложений услуг) зачисляется
        на внутренний счёт Пользователя в Личном Кабинете в Сервисе TASK. Пользователь может выбрать
        между несколькими различными способами получения Вознаграждения Пользователя. Все доступные
        Пользователю способы получения Вознаграждения Пользователя отображаются в Личном Кабинете.
        <br />
        3.7. Принимая условия настоящего Договора-Оферты Пользователь соглашается с тем, что расчёты
        по настоящему Договору-Оферте могут производиться Оператором, в том числе, с помощью третьих
        лиц – партнёров Оператора. Соответственно, для целей осуществления расчётов между Оператором
        и Пользователем по настоящему Договору-Оферте Пользователю может быть необходимо принять
        условия договоров-оферт таких партнёров Оператора, помогающих Оператору осуществлять расчёты
        с Пользователем, таких как поставщики платёжных услуг, партнёрских сервисов, и иных
        аналогичных компаний-партнёров Оператора.
        <br />
        3.8. Оператор не несёт ответственности за любые суммы, которые могут взиматься банками,
        платёжными системами, поставщиками платёжных услуг и иными третьими лицами как при получении
        Пользователем Вознаграждения Пользователя по настоящему Договору-Оферте, так и при авансовой
        оплате Пользователем сумм Цены Услуг за Услуги. Пользователь самостоятельно несёт риски,
        связанные с выбранным Пользователем способом получения Вознаграждения Пользователя и оплаты
        Цены Услуг за Услуги, такими как комиссии платёжных систем, банковские комиссии и иные
        платежи и комиссии, удерживаемые банками, платёжными системами, и иными поставщиками
        платёжных услуг любого рода.
        <br />
        3.9. Пользователь соглашается, что Пользователь самостоятельно обязан уплачивать все налоги
        и сборы, которые применяются к суммам Цены Услуг Пользователя, и что Оператор не является
        налоговым агентом Пользователя по настоящему Договору-Оферте или иным образом.
        <br />
        <h2>4. Срок действия и прекращение действия</h2>
        4.1. Настоящий Договор-Оферта вступает в силу непосредственно в момент принятия его условий
        Пользователем, и продолжает действовать в полной силе до момента прекращения использования
        Сервиса TASK Пользователем.
        <br />
        4.2. Пользователь вправе прекратить доступ к Сервису TASK и получение Услуг, если
        Пользователь больше не желает использовать Сервис и получать Услуги в любое время.
        <br />
        4.3. Оператор вправе расторгнуть настоящий Договор-Оферту в одностороннем внесудебном
        порядке в любой момент времени, по единоличному усмотрению Оператора, в том числе в случае
        нарушения Пользователем любого положения Договора-Оферты либо любого положения любого из
        Связанных Документов.
        <br />
        <h2>5. Связанные документы</h2>
        5.1. Одновременно с принятием условий настоящего Договора-Оферты и регистрацией Личного
        Кабинета в Сервисе TASK Пользователь принимает условия всех документов, связанных с
        настоящим Договором-Офертой, Сервисом TASK и Услугами, регулирующих отдельные вопросы
        использования Сервиса TASK и предоставления Услуг и включённых в настоящий Договор-Оферту
        посредством ссылки (совместно, &quot;Связанные Документы&quot;):
        <br />
        5.1.1. Условия Предоставления Услуг Сервиса TASK, доступные по адресу
        https://TASK.bz/docs/uslovia;
        <br />
        5.1.2. Политику Конфиденциальности Сервиса TASK, доступную по адресу
        https://TASK.bz/docs/privacy;
        <br />
        5.2. Принимая условия настоящего Договора-Оферты и регистрируя Личный Кабинет в Сервисе TASK
        Пользователь подтверждает, что он принимает все условия всех Связанных Документов и
        соглашается быть юридически связан условиями, в том числе, Связанных Документов.
        5.3. Пользователь явным образом соглашается, что все условия Связанных Документов включены в
        настоящий Договор посредством ссылки и юридически действуют так же и применяются к
        отношениям Сторон по Договору-Оферте, как если бы они были прямо включены в настоящий
        Договор-Оферту. Связанные Документы могут устанавливать иную ответственность за нарушение
        как их положений, так и Договора-Оферты. Пользователь обязуется соблюдать условия и
        требования таких Связанных Документов в течение всего срока действия настоящего
        Договора-Оферты.
        <br />
        <br />
        <h2>6. Общие положения</h2>
        6.1. Пользователь явным образом соглашается, что все условия Связанных Документов включены в
        настоящий Договор посредством ссылки и юридически действуют так же и применяются к
        отношениям Сторон по Договору-Оферте, как если бы они были прямо включены в настоящий
        Договор-Оферту. Связанные Документы могут устанавливать иную ответственность за нарушение
        как их положений, так и Договора-Оферты. Пользователь обязуется соблюдать условия и
        требования таких Связанных Документов в течение всего срока действия настоящего
        Договора-Оферты.
        <br />
        6.2. Настоящий Договор-Оферта регулируется и толкуется в соответствии с законодательством
        Белиза.
        <br />
        6.3. Пользователь и Оператор соглашаются подчиниться исключительной юрисдикции компетентных
        судов Белиза в отношении разрешения любых правовых вопросов, возникающих из настоящего
        Договора-Оферты. Настоящее положение сохраняет свою полную юридическую силу вне зависимости
        от прекращения Пользователем использования Сервиса TASK по любой причине.
        <br />
        6.4. В максимально разрешённой применимым правом степени Оператор оставляет за собой право
        модифицировать, обновлять, дополнять, пересматривать или иным образом изменять настоящий
        Договор-Оферту, чтобы он соответствовал новому применимому законодательству и/или
        нормативно-правовым актам, и/или для целей улучшения Сервиса TASK, а также время от времени
        устанавливать новые или дополнительные правила, политики или условия в отношении Сервиса
        TASK, уведомляя или не уведомляя Пользователя об этом. Оператор может уведомить Пользователя
        о поправках, внесенных в настоящий Договор-Оферту, выслав электронное письмо на адрес
        электронной почты, указанный в Личном Кабинете Пользователя, или разместив сообщение с таким
        уведомлением в Сервисе TASK. Все поправки к настоящему Договору-Оферте будут незамедлительно
        вступать в силу и включаться в Договор-Оферту по факту направления или размещения такого
        уведомления. Пользователь единолично несёт ответственность за регулярное ознакомление с
        настоящим Договором-Офертой. Использование Пользователем Сервиса TASK или любой его части
        после того, как любые изменения в настоящем Договоре-Оферте были отражены в сообщении в
        Сервисе TASK или иным образом стали доступными для ознакомления, будет считаться согласием с
        такими изменениями, и будет отражать готовность Пользователя принять на себя обязательства
        по ним. Если Пользователь не согласен с какими-либо из таких изменений, единственной
        доступной формой отказа для Пользователя является удаление Личного Кабинета Пользователя и
        прекращение использования Сервиса TASK.
        <br />
        6.5. Если суд компетентной юрисдикции сочтет какую-либо часть данного Договора-Оферты
        незаконной, недействительной или по какой-либо причине не могущей быть приведённой в
        исполнение в принудительном порядке, такое положение будет считаться отделимым от данного
        Договора-Оферты и не повлияет на действительность и возможность приведения в исполнение в
        принудительном порядке у любых оставшихся положений.
        <br />
        6.6. Положения настоящего Договора-Оферты, которые должны по своему назначению или по своей
        сути остаться в силе после прекращения использования Пользователем Сервиса TASK, будут
        продолжать действовать после такого прекращения по любой причине.
        <br />
        6.7. Пользователь соглашается с тем, что Пользователь не считается агентом, работником или
        участником совместного предприятия Оператора, и что Пользователь не должен представляться
        таковым.
        <br />
        6.8. Пользователь не вправе переуступать свои права и обязанности по настоящему
        Договору-Оферте полностью или частично, и любая предпринятая попытка переуступки в нарушение
        данного положения будет считаться не имеющей юридической силы. Оператор вправе переуступить
        настоящий Договор-Оферту или любые свои права и обязанности по нему без согласия
        Пользователя в любое время.
        <br />
        6.9. Никакой отказ от разбирательства в отношении любого неисполнения, условия или нарушения
        настоящего Договора-Оферты не будет представлять собой отказ от разбирательства в отношении
        любого другого неисполнения, условия или нарушения настоящего Договора-Оферты, как сходного,
        так и иного по своей природе.
        <br />
        6.10. Ни при каких обстоятельствах Оператор не будет нести ответственность за любое
        неисполнение обязательств, возникающее вследствие причин, объективно не поддающихся контролю
        Оператора, в том числе без ограничений: стихийных бедствий, войн, терроризма, восстаний,
        эмбарго, действий гражданских или военных властей, пожаров, наводнений, аварий, забастовок
        или недостатка транспортных средств, топлива, энергии, рабочей силы или материалов.
        <br />
        6.11. Настоящий Договор-Оферта представляет собой полное соглашение между Пользователем и
        Оператором в отношении предмета настоящего Договора-Оферты. Независимо от вышеизложенного,
        любые дополнительные условия, которые в явной форме содержатся в или становятся доступными
        посредством Сервиса TASK, в любой момент времени будут регулировать объекты, функции, службы
        или иные объекты, к которым они относятся.
        <br />
        <h2>7. Контактная информация</h2>
        7.1. Если у Пользователя возникают какие-либо комментарии или вопросы в отношении
        осуществления Пользователем доступа к Сервису TASK или его использования, Пользователь может
        обратиться к Оператору используя следующую контактную информацию для связи с Оператором:
        task@task.bz
      </Col>
    </Row>
  </Container>
);
